cf/DataProcessors/ИзменениеОрганизацииВЗаявке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ИзменениеОрганизацииВЗаявке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентРучнойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Акция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/DataProcessors/ИзменениеОрганизацииВЗаявке/Ext/ObjectModule.bsl
Процедура ПрименитьИзменения() Экспорт
	
	Если Заказ.Организация = Организация Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтавкуНДС = Ложь;
	
	Если Заказ.Организация.УчитыватьНДС <> Организация.УчитыватьНДС Тогда
		ЗаполнитьСтавкуНДС = Истина;
	КонецЕсли;
	
	// замена ставки ндс
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                     |	ЗаказыПокупателей.Регистратор
	                     |ИЗ
	                     |	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	                     |ГДЕ
	                     |	ЗаказыПокупателей.ЗаказПокупателя = &Заказ
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	ЗаказыПокупателей.Регистратор");
						 
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//ЗаказОбъект = ЗаказНаряд.ПолучитьОбъект();
	//ЗаказОбъект.Организация = Касса.Организация;
	//
	//ЗаполнитьЗначенияСвойств(СтруктураКолонокТовары, ЗаказОбъект); 

	//СтруктураКолонокТовары.ЕстьВсего = Ложь;
	//СтруктураРеквизитов = ФункцииФормДокументов.ОрганизацияПриИзменении(ЗаказОбъект);
	//
	//Для Каждого Строка ИЗ СтруктураРеквизитов Цикл
	//	Имя = Строка.Ключ;
	//	Если СтруктураКолонокТовары.Свойство("ст" + Имя) Тогда
	//		СтруктураКолонокТовары["ст" + Имя] = СтруктураКолонокТовары[Имя];	
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ЗаполнитьЗначенияСвойств(СтруктураКолонокТовары, СтруктураРеквизитов);
	//
	//Для Каждого СтрокаТовара ИЗ ЗаказОбъект.Товары Цикл
	//	
	//	ФункцииФормДокументов.РассчитатьСуммыТабличныхЧастей(СтрокаТовара, СтруктураКолонокТовары);
	//	СтрокаТовара.Сумма = ?(СтрокаТовара.Гарантия, 0, СтрокаТовара.Сумма);

	//КонецЦикла;			
	//
	//Попытка
	//	ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	//Исключение
	//	стрОшибки = ОписаниеОшибки();
	//	ОбщиеФункции.СообщитьТекст("Ошибка при записи заказ-наряда
	//							|" + стрОшибки);
	//	Возврат Ложь;
	//КонецПопытки;
	//
	//Организация =  ЗаказОбъект.Организация;
	//
	//Если Касса.Организация = Организация Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//Возврат Ложь;
						 
	                               
КонецПроцедуры
